# İleri Birleştirme İşlemleri

In [2]:
import numpy as np
import pandas as pd

In [25]:
df1 = pd.DataFrame({
                        "workers":["Jacob","Emily","Jason","Mark"],
                        "group":["Engineering","Engineering","Business Management","HR"]
                    })
df1

  workers                group
0   Jacob          Engineering
1   Emily          Engineering
2   Jason  Business Management
3    Mark                   HR

In [26]:
df2 = pd.DataFrame({
                        "workers":["Jacob","Emily","Jason","Mark"],
                        "entry_date":[2010,2009,2014,2005]
                    })
df2

  workers  entry_date
0   Jacob        2010
1   Emily        2009
2   Jason        2014
3    Mark        2005

In [27]:
pd.merge(df1,df2)

  workers                group  entry_date
0   Jacob          Engineering        2010
1   Emily          Engineering        2009
2   Jason  Business Management        2014
3    Mark                   HR        2005

In [28]:
pd.merge(df1,df2, on = "workers")

  workers                group  entry_date
0   Jacob          Engineering        2010
1   Emily          Engineering        2009
2   Jason  Business Management        2014
3    Mark                   HR        2005

In [29]:
df3 = pd.merge(df1,df2)
df3

  workers                group  entry_date
0   Jacob          Engineering        2010
1   Emily          Engineering        2009
2   Jason  Business Management        2014
3    Mark                   HR        2005

In [30]:
df4 = pd.DataFrame({
                        "group":["Business Management","Engineering","HR"],
                        "manager":["Emry","Michael","Bessy"]
                    })
df4

                 group  manager
0  Business Management     Emry
1          Engineering  Michael
2                   HR    Bessy

In [31]:
pd.merge(df3,df4)

  workers                group  entry_date  manager
0   Jacob          Engineering        2010  Michael
1   Emily          Engineering        2009  Michael
2   Jason  Business Management        2014     Emry
3    Mark                   HR        2005    Bessy

In [ ]:
df5 = pd.DataFrame({
                        "abilities":["Math","Excel","Coding","Linux","Cloud","Excel"],
                        "group":["Engineering","Engineering","Business Management","Business Management","HR","HR"]
                    })
df5